<?php
/* +----------------------------------------------------------------------
 * 作    者: daybreak <1371626452@qq.com>
  +----------------------------------------------------------------------
 * 创建日期：2013-09-13
  +----------------------------------------------------------------------
 * 文件描述：
  +----------------------------------------------------------------------
 * 升级记录： 
  +----------------------------------------------------------------------
 */
    //目录安全文件
    define('BUILD_DIR_SECURE',true);
    define('DIR_SECURE_FILENAME', 'index.html,index.htm,default.html');
    define('DIR_SECURE_CONTENT', '错误的请求!');

    define('THINK_PATH', './ThinkPHP/');
    //定义项目名称
    define('APP_NAME','webs');
    //项目路径
    define('APP_PATH','./webs/');
	define('APP_DEBUG', true);
    //引入ThinkPHP核心文件
    require THINK_PATH.'ThinkPHP.php';
