<?php
/* +----------------------------------------------------------------------
 * 作          者: songyb <1371626452@qq.com>
 +----------------------------------------------------------------------
 * 创建日期：2015-05-05
 +----------------------------------------------------------------------
 * 文件描述：
 +----------------------------------------------------------------------
 * 升级记录： 
 +----------------------------------------------------------------------
*/
class WorkerModel extends CommonModel{
    // 自动验证设置
    protected $_validate = array(
        array('name', 'require', '姓名不能为空！'),
        array('id_card_no', 'require', '身份证号不能为空！'),
        array('pwd', 'require', '密码不能为空！'),
        array('phone', 'require', '联系方式不能为空！'),
    );
    // 自动填充设置
    protected $_auto = array(
        array('operator','getUserId',1,'callback'),
        array('update_date','getDate',1,'callback'),
    );  
}